# MassDataSurfaceDataSource Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MassDataSurfaceDataSource Property
ParameterTypeId Class See Also
---
"Values"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MassDataSurfaceDataSource { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MassDataSurfaceDataSource As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MassDataSurfaceDataSource {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace